{
  "dzial": "1. Wprowadzenie i wirtualizacja",
  "tematy": [
    {
      "id": "1.1",
      "tytul": "Wprowadzenie do wirtualizacji",
      "lekcja": "Wirtualizacja to technologia umożliwiająca uruchamianie wielu systemów operacyjnych na jednym fizycznym komputerze.\n\nDziała dzięki specjalnemu oprogramowaniu zwanemu hypervisorem, które kontroluje i zarządza wirtualnymi maszynami (VM). Istnieją dwa główne typy hypervisorów:\n\nTyp 1 – działa bezpośrednio na sprzęcie (np. VMware ESXi, Microsoft Hyper-V Server),\n\nTyp 2 – uruchamiany jest w systemie operacyjnym (np. Oracle VirtualBox, VMware Workstation).\n\nHypervisor pozwala tworzyć maszyny wirtualne, którym przypisujemy zasoby fizyczne komputera: pamięć RAM, rdzenie procesora, miejsce na dysku czy kartę sieciową. Przydzielając zasoby, należy pamiętać o równowadze – VM musi działać płynnie, ale nie może przeciążyć komputera hosta. Przykładowo: jeśli komputer ma 8 GB RAM, to zaleca się przypisanie 2–4 GB dla maszyny wirtualnej.\n\nAby wirtualizacja działała poprawnie, musi być aktywna w BIOS/UEFI komputera. Opcji należy szukać pod nazwami takimi jak Intel VT-x, AMD-V, Virtualization Technology. W nowszych komputerach opcja ta bywa domyślnie włączona, jednak warto to sprawdzić.\n\nMaszyna wirtualna działa jako osobne środowisko i może mieć zainstalowany dowolny system operacyjny. System hosta to ten zainstalowany fizycznie, a system gościa (guest) działa na VM.\n\nWirtualizacja znajduje szerokie zastosowanie: w edukacji, testowaniu oprogramowania, cyberbezpieczeństwie oraz do tworzenia izolowanych środowisk pracy. W kolejnych krokach uczniowie nauczą się samodzielnie instalować i konfigurować takie maszyny.",
      "pytania": [
        {
          "pytanie": "Czym zajmuje się hypervisor?",
          "odpowiedzi": [
            "Rysowaniem schematów sieciowych",
            "Zarządzaniem maszynami wirtualnymi",
            "Instalacją systemu operacyjnego hosta",
            "Konfigurowaniem sieci bezprzewodowej"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Czym różni się hypervisor typu 1 od typu 2?",
          "odpowiedzi": [
            "Typ 1 działa w systemie operacyjnym, a typ 2 bezpośrednio na sprzęcie",
            "Typ 1 działa bezpośrednio na sprzęcie, a typ 2 w systemie operacyjnym",
            "Typ 1 obsługuje tylko systemy Windows, typ 2 tylko Linux",
            "Typ 1 służy do testowania gier, typ 2 do programowania"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Gdzie włącza się funkcję wirtualizacji (np. Intel VT-x, AMD-V)?",
          "odpowiedzi": [
            "W ustawieniach systemu operacyjnego",
            "W menedżerze urządzeń",
            "W BIOS/UEFI komputera",
            "W panelu sterowania VirtualBox"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Jak najlepiej dobrać ilość RAM dla maszyny wirtualnej przy 8 GB RAM w komputerze?",
          "odpowiedzi": [
            "6 GB, żeby VM działała płynnie",
            "8 GB, żeby wykorzystać pełną moc",
            "2–4 GB, aby nie obciążyć hosta",
            "Nie ma potrzeby przydzielania RAM"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "W jakich zastosowaniach wirtualizacja jest szczególnie przydatna?",
          "odpowiedzi": [
            "Tylko do gier komputerowych",
            "Do izolacji środowisk testowych i nauki systemów",
            "Do przyspieszania Internetu",
            "Do kopiowania plików między komputerami"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Jak nazywa się system operacyjny działający wewnątrz maszyny wirtualnej?",
          "odpowiedzi": [
            "Host",
            "Bazowy",
            "Guest",
            "Sterownik"
          ],
          "poprawna": [
            2
          ]
        }
      ]
    },
    {
      "id": "1.2",
      "tytul": "Instalacja środowiska wirtualnego",
      "lekcja": "Jednym z najpopularniejszych programów do wirtualizacji jest VirtualBox, który jest darmowy i dostępny na różne systemy operacyjne. Można go pobrać ze strony: https://www.virtualbox.org. Inną alternatywą jest VMware Workstation Player, również darmowy do użytku niekomercyjnego.\n\nPo zainstalowaniu VirtualBoxa należy uruchomić program i wybrać opcję \"Nowa\", aby utworzyć nową maszynę wirtualną. W kreatorze podajemy nazwę VM, wybieramy typ i wersję systemu operacyjnego (np. Linux, Ubuntu 64-bit), przydzielamy ilość RAM (zalecane 2–4 GB), ustalamy liczbę rdzeni CPU i tworzymy wirtualny dysk twardy (np. 20 GB w formacie VDI).\n\nW kolejnym kroku podpinamy obraz ISO systemu operacyjnego – to plik, który zawiera instalkę systemu, np. Ubuntu, Windows 10. Obrazy ISO można pobrać ze stron producentów, np. ubuntu.com czy microsoft.com.\n\nWażnym elementem jest również ustawienie trybu sieciowego. Najczęściej wybiera się NAT – maszyna wirtualna korzysta wtedy z połączenia internetowego hosta. W bardziej zaawansowanych zastosowaniach używa się trybu Bridged Adapter lub Host-only.\n\nPrzed uruchomieniem maszyny warto przejrzeć ustawienia, np. foldery współdzielone, które umożliwiają wymianę plików między hostem a gościem, oraz aktywować akcelerację sprzętową, jeśli jest dostępna.\n\nDobrą praktyką jest tworzenie snapshotów (migawk) – zapisów stanu maszyny w danym momencie, do których można później wrócić, jeśli coś pójdzie nie tak.\n\nPo zakończeniu konfiguracji można uruchomić maszynę i rozpocząć instalację systemu operacyjnego wewnątrz niej. Jest to pierwszy krok do pracy z wirtualnymi środowiskami, które będą wykorzystywane na kolejnych etapach nauki.",
      "pytania": [
        {
          "pytanie": "Skąd można pobrać program VirtualBox?",
          "odpowiedzi": [
            "Ze sklepu Google Play",
            "Z oficjalnej strony: virtualbox.org",
            "Z aplikacji Microsoft Store",
            "Z BIOS-u komputera"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Który krok wykonujemy jako pierwszy przy tworzeniu maszyny wirtualnej w VirtualBox?",
          "odpowiedzi": [
            "Wskazanie obrazu ISO",
            "Ustawienie opcji sieciowych",
            "Utworzenie nowej maszyny (Nowa)",
            "Instalacja systemu operacyjnego"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Co to jest obraz ISO?",
          "odpowiedzi": [
            "Plik instalacyjny systemu operacyjnego",
            "Folder współdzielony",
            "Format kopii zapasowej",
            "Program do wirtualizacji"
          ],
          "poprawna": [
            0
          ]
        },
        {
          "pytanie": "Jaki tryb sieciowy najczęściej wybieramy w VirtualBoxie przy podstawowej konfiguracji?",
          "odpowiedzi": [
            "Host-only",
            "Bridged Adapter",
            "NAT",
            "VPN"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Do czego służy snapshot (migawka) w maszynie wirtualnej?",
          "odpowiedzi": [
            "Do wykonania zrzutu ekranu",
            "Do cofnięcia maszyny do wcześniejszego stanu",
            "Do zwiększenia RAM-u",
            "Do zapisania obrazu ISO"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Co należy zrobić, aby maszyna mogła wymieniać pliki z systemem hosta?",
          "odpowiedzi": [
            "Włączyć BIOS",
            "Zainstalować drugi dysk",
            "Skonfigurować folder współdzielony",
            "Odłączyć sieć"
          ],
          "poprawna": [
            2
          ]
        }
      ]
    },
    {
      "id": "1.3",
      "tytul": "Planowanie instalacji systemu operacyjnego",
      "lekcja": "Przed rozpoczęciem instalacji systemu operacyjnego należy zaplanować sposób jego wdrożenia oraz przygotować sprzęt i nośniki. Kluczowe jest sprawdzenie wymagań systemowych – dotyczą one m.in. minimalnej ilości pamięci RAM, miejsca na dysku, procesora i kompatybilności z architekturą 32/64-bit. Należy także zdecydować, jaki system będzie instalowany – systemy desktopowe różnią się od serwerowych wymaganiami i funkcjonalnością. Kolejnym krokiem jest planowanie partycji – czyli podziału dysku. Tworzy się partycję systemową, partycję danych oraz – w Linuxie – partycję wymiany (swap). Każda partycja musi być sformatowana w odpowiednim systemie plików: NTFS, FAT32, exFAT lub ext4. Obraz ISO systemu można pobrać ze strony producenta i przygotować na nośniku USB za pomocą narzędzia takiego jak Rufus. Dobrze zaplanowana instalacja pozwala uniknąć błędów i poprawia wydajność systemu.",
      "pytania": [
        {
          "pytanie": "Który z zasobów NIE należy do wymagań systemowych systemu operacyjnego?",
          "odpowiedzi": [
            "Procesor",
            "Licencja użytkownika",
            "Pamięć RAM",
            "Miejsce na dysku"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Co to jest partycja swap?",
          "odpowiedzi": [
            "Partycja do zapisywania logów systemowych",
            "Partycja do rozszerzenia pamięci RAM",
            "Partycja startowa Windows",
            "Folder wymiany plików z siecią"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Który z systemów plików jest domyślnie używany w systemach Linux?",
          "odpowiedzi": [
            "NTFS",
            "FAT32",
            "exFAT",
            "ext4"
          ],
          "poprawna": [
            3
          ]
        },
        {
          "pytanie": "Który system plików umożliwia zapis plików większych niż 4 GB i jest stosowany w Windows?",
          "odpowiedzi": [
            "FAT32",
            "NTFS",
            "ext4",
            "exFAT"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Do czego służy program Rufus?",
          "odpowiedzi": [
            "Do obsługi sieci bezprzewodowej",
            "Do kompresji plików",
            "Do tworzenia bootowalnych pendrive'ów z obrazem ISO",
            "Do montowania napędów CD"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Jaka jest zaleta podziału dysku na kilka partycji (system, dane, swap)?",
          "odpowiedzi": [
            "System działa szybciej",
            "Łatwiej znaleźć gry i multimedia",
            "Można łatwiej odświeżać pulpit",
            "Ułatwia zarządzanie danymi i reinstalację systemu"
          ],
          "poprawna": [
            3
          ]
        }
      ]
    },
    {
      "id": "1.4",
      "tytul": "Przygotowanie środowiska ucznia",
      "lekcja": "Po zainstalowaniu systemu operacyjnego wewnątrz maszyny wirtualnej należy przygotować środowisko do pracy ucznia. W tym celu tworzy się osobne konto użytkownika z odpowiednią nazwą i hasłem. Można ustawić preferencje językowe, układ klawiatury oraz podstawowe ustawienia pulpitu. Kolejnym krokiem jest instalacja narzędzi – edytor tekstu, terminal, przeglądarka, klient FTP i inne. Warto aktywować foldery współdzielone oraz włączyć akcelerację sprzętową. Snapshoty (migawki) pozwalają zapisać stan maszyny. Uczeń powinien dokumentować swoją pracę – np. zrzuty ekranu i komendy. Dobre przygotowanie środowiska umożliwia efektywną naukę i rozwiązywanie zadań.",
      "pytania": [
        {
          "pytanie": "Po co tworzy się osobne konto ucznia w maszynie wirtualnej?",
          "odpowiedzi": [
            "Żeby przyspieszyć działanie systemu",
            "Żeby oddzielić środowisko pracy i nadać odpowiednie uprawnienia",
            "Żeby móc korzystać z drugiego dysku",
            "Żeby zmienić język systemu"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Które z poniższych narzędzi NIE jest typowo instalowane w środowisku ucznia?",
          "odpowiedzi": [
            "Edytor tekstu",
            "Przeglądarka internetowa",
            "Program antywirusowy serwera DNS",
            "Klient FTP"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Do czego służy folder współdzielony w VirtualBoxie?",
          "odpowiedzi": [
            "Do połączenia dwóch maszyn wirtualnych",
            "Do zapisu logów systemowych",
            "Do wymiany plików między systemem hosta i gościa",
            "Do aktualizacji systemu"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Co to jest snapshot (migawka)?",
          "odpowiedzi": [
            "Zrzut ekranu z konfiguracją systemu",
            "Plik z ustawieniami BIOSu",
            "Zapis stanu maszyny wirtualnej",
            "Folder systemowy z katalogiem użytkownika"
          ],
          "poprawna": [
            2
          ]
        },
        {
          "pytanie": "Dlaczego dokumentowanie działań ucznia (np. zrzuty ekranu) jest ważne?",
          "odpowiedzi": [
            "Żeby obciążyć system",
            "Żeby udokumentować pracę i móc ją łatwiej odtworzyć",
            "Żeby zmniejszyć rozmiar maszyny",
            "Żeby przyspieszyć instalację systemu"
          ],
          "poprawna": [
            1
          ]
        },
        {
          "pytanie": "Który element NIE należy do przygotowania środowiska ucznia?",
          "odpowiedzi": [
            "Instalacja potrzebnych programów",
            "Konfiguracja folderów współdzielonych",
            "Tworzenie konta użytkownika",
            "Odinstalowanie VirtualBoxa"
          ],
          "poprawna": [
            3
          ]
        }
      ]
    }
  ]
}